Table of Contents
 Interface IIdeaCrossSectionComponent
Namespace
IdeaStatiCa.BimApi
Assembly
IdeaStatiCa.BimApi.dll
A component of a IIdeaCrossSectionByComponents.
public interface IIdeaCrossSectionComponent
Properties
 Geometry
Geometry of the component.
Region2D Geometry { get; }
Property Value
Region2D
 Material
Material of the component.
IIdeaMaterial Material { get; }
Property Value
IIdeaMaterial
 Phase
Phase
int Phase { get; }
Property Value
int
 Edit this page